CARLOS-QL/PIC18F2550_4550_EJEMPLOS/TMR1_OSC_PIC18F4550/TMR1_OSC_PIC18F4550.X/main.c
/*
 * File:   main.c
 * Author: Carlos QL
 *
 * Created on December 23, 2018, 9:27 AM
 */
// CONFIG1L
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config USBDIV = 1       // USB Clock Selection bit (used in Full-Speed USB mode only; UCFG:FSEN = 1) (USB clock source comes directly from the primary oscillator block with no postscale)

// CONFIG1H
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator (HS))
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config VREGEN = OFF     // USB Voltage Regulator Enable bit (USB voltage regulator disabled)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = ON      // PORTB A/D Enable bit (PORTB<4:0> pins are configured as analog input channels on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)
#pragma config ICPRT = OFF      // Dedicated In-Circuit Debug/Programming Port (ICPORT) Enable bit (ICPORT disabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection bit (Block 0 (000800-001FFFh) is not code-protected)
#pragma config CP1 = OFF        // Code Protection bit (Block 1 (002000-003FFFh) is not code-protected)
#pragma config CP2 = OFF        // Code Protection bit (Block 2 (004000-005FFFh) is not code-protected)
#pragma config CP3 = OFF        // Code Protection bit (Block 3 (006000-007FFFh) is not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot block (000000-0007FFh) is not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM is not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000800-001FFFh) is not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (002000-003FFFh) is not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (004000-005FFFh) is not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (006000-007FFFh) is not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) are not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot block (000000-0007FFh) is not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM is not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000800-001FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (002000-003FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (004000-005FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (006000-007FFFh) is not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot block (000000-0007FFh) is not protected from table reads executed in other blocks)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#include <stdint.h>
#define _XTAL_FREQ 20000000

uint8_t conteo = 0;
uint8_t numDisplay[4] = {0X01, 0X02, 0X04, 0X08};
uint8_t digito[4];//uint8_t mil, cen, dec, uni;
uint8_t display[10] = {0x3F, 0x06, 0x5B, 0x4F, 0x66, 0x6D, 0x7D, 0x07, 0x7F, 0x6F};
volatile uint16_t contador = 4781;


void __interrupt() TMR1_isr(){
    
    if(TMR1IF == 1){
        TMR1 = 0X8000;
        contador++;
        TMR1IF = 0;
    }
}

/*
 numero = 1458
 1458 / 1000 = 1 -> mil
 1458 % 1000 = 458 -> numero
 
 458 / 100 = 4 -> cen
 458 % 100 = 58 -> numero
 
 58 / 10 = 5 -> dec
  58 % 10 = 8 -> uni
 
 */


void descomponerNumero(uint16_t numero){
    
    digito[0] = numero/1000;
    numero = numero % 1000;
    digito[1] = numero/100;
    numero = numero % 100;
    digito[2] = numero/10;
    digito[3] = numero % 10;
    
    
}

void mostrarDato(){
     LATD = display[digito[conteo]];
        LATB = numDisplay[conteo];
        
        conteo++; 
        if(conteo==4) conteo =0;
}
void main(void) {
    
    
    TRISD = 0;
    LATD = 0;
    TRISB = 0;
    PORTB = 0;
    
     GIE = 1;
    PEIE = 1;
    TMR1IF = 0;
    TMR1IE = 1;
    
    
    
    TMR1CS = 1;     //Conteo de eventos externos
    T1OSCEN = 1;    //Modo oscilador o reloj
    
    T1CKPS1 = 0;    //pRESCALER 1
    T1CKPS0 = 0;
    
    T1SYNC = 1;     //No sincronizado
    
    TMR1 = 0X8000;   //pARA GENERAR UN DESBORDAMITNO DE 1s
    
    TMR1ON = 1;     //TIMER1 on
    
    while(1){
         
          /*
         
         * uint8_t numDisplay[4] = {0X01, 0X02, 0X04, 0X08};
         * mil  -> digito[0]
         * cen  -> digito[1]
         * dec  -> digito[2]
         * uni  -> digito[3]
         */
        descomponerNumero(contador);
       mostrarDato();
         __delay_ms(1);
        
        
                                
    }
    return;
}
